describe('Проверка авторизации', function () { //это блок группировки тестов

    it('Верный логин и верный пароль', function () { //это функция для описания отдельного тестового сценария 
        cy.visit('https://10.0.206.80:11960'); //Заходим на сайт
        cy.get('#lg').type('ilya_f'); //Находим и заполняем поле логин
        cy.get('.input-actions-form-control > #pd').type('Iva#Sbc789'); //Находим и заполняем поле пароль
        cy.get('.d-grid > .btn').click(); //Находим копку Войти и кликаем по ней
        cy.url().should('eq', 'https://10.0.206.80:11960/dashboard/proxying-servers') //ОР - Мы в ЛК
        
    })

        it('Верный логин и неверный пароль', function () {
        cy.visit('https://10.0.206.80:11960'); //Заходим на сайт
        cy.get('#lg').type('ilya_f'); //Находим и заполняем поле логин
        cy.get('.input-actions-form-control > #pd').type('Iva#Sbc789214'); //Находим и заполняем поле пароль
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.d-grid > .btn').click(); //Находим копку Войти и кликаем по ней
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.mb-3').contains('Вы ввели неверный логин или пароль'); //Проверить вывод текста
        cy.get('.mb-3').should('be.visible'); //Проверить что текст выден пользователю
        cy.get('.mb-3').should('have.css', 'color', 'rgb(237, 84, 77)'); //Проверить css свойство

    })

        it('Неверный логин и верный пароль', function () {
        cy.visit('https://10.0.206.80:11960'); //Заходим на сайт
        cy.get('#lg').type('klfgike'); //Находим и заполняем поле логин
        cy.get('.input-actions-form-control > #pd').type('Iva#Sbc789'); //Находим и заполняем поле пароль
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.d-grid > .btn').click(); //Находим копку Войти и кликаем по ней
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.mb-3').contains('Вы ввели неверный логин или пароль'); //Проверить вывод текста
        cy.get('.mb-3').should('be.visible'); //Проверить что текст выден пользователю
        cy.get('.mb-3').should('have.css', 'color', 'rgb(237, 84, 77)'); //Проверить css свойство

    })

        it('Неверный логин и неверный пароль', function () {
        cy.visit('https://10.0.206.80:11960'); //Заходим на сайт
        cy.get('#lg').type('klike67'); //Находим и заполняем поле логин
        cy.get('.input-actions-form-control > #pd').type('Iva#Sbc7894343'); //Находим и заполняем поле пароль
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.d-grid > .btn').click(); //Находим копку Войти и кликаем по ней
        cy.wait(2000); //Подождать 2 секунды
        cy.get('.mb-3').contains('Вы ввели неверный логин или пароль'); //Проверить вывод текста
        cy.get('.mb-3').should('be.visible'); //Проверить что текст выден пользователю
        cy.get('.mb-3').should('have.css', 'color', 'rgb(237, 84, 77)'); //Проверить css свойство

    })

})